% 定义常数和参数
g = 9.8;      % 重力加速度
k = 96000;     % 弹簧劲度系数
m1 = 25;       % 物体1的质量
m2 = 40;       % 物体2的质量
m3 = 50;       % 物体2的质量
t0 = 0.0;     % 初始时间
tf = 800.0;    % 结束时间
dt = 0.00001;    % 时间步长
R = 5;
N = 60;
Sh = 0.08;
Ca = 2.3;
Cd = 16;
Fc = 2.5;
Pi = 3.14;
E1 =180;
E2 =328;
E3 =538;

y1 = zeros(1, 2);  % 物体1的位置
y2 = zeros(1, 2);  % 物体2的位置
y3 = zeros(1, 2);  % 物体3的位置
v1 = zeros(1, 2);  % 物体1的速度
v2 = zeros(1, 2);  % 物体2的速度
v3 = zeros(1, 2);  % 物体3的速度
y11max = 0;
y12max = 0;
y21max = 0;
y22max = 0;
% 初始条件
y1(1) = 0;       % 物体1的初始位置
y2(1) = 0;      % 物体2的初始位置
y3(1) = 0;      % 物体2的初始位置
v1(1) = 0;       % 物体1的初始速度
v2(1) = 0;       % 物体2的初始速度
v3(1) = 0;       % 物体2的初始速度

% 数值求解
for i = 1:10^7
    % 物体1接触弹簧，物体2自由落体
    if y1((i/2)*2+2-i) >= y2((i/2)*2+2-i)&&y3((i/2)*2+2-i) >= y2((i/2)*2+2-i)&&y2((i/2)*2+2-i) <= 0
        Ft = -N*k*(sqrt(R*R+y2((i/2)*2+2-i)*y2((i/2)*2+2-i))-R)*y2((i/2)*2+2-i)/sqrt(R*R+y2((i/2)*2+2-i)*y2((i/2)*2+2-i));     % 弹簧力
        Fa = Pi*Ca*R*R*R*v2((i/2)*2+2-i)*v2((i/2)*2+2-i)*sign(v2((i/2)*2+2-i))/(sqrt(R*R+y2((i/2)*2+2-i)*y2((i/2)*2+2-i))*6);
        Fd = -Cd*v2((i/2)*2+2-i)*sign(v2((i/2)*2+2-i));
        Fc = 2.5*sign(v2((i/2)*2+2-i));
        Fm1 = - Ca*Sh*(v1((i/2)*2+2-i)*v1((i/2)*2+2-i))*sign(v1((i/2)*2+2-i));
        Fm3 = - Ca*Sh*(v3((i/2)*2+2-i)*v3((i/2)*2+2-i))*sign(v3((i/2)*2+2-i));
        a2 = (Ft-Fa-Fd-Fc - m2 * g) / m2;       % 物体1的加速度
        a1 = -g+Fm1/m1;                      % 物体2的加速度
        a3 = -g+Fm3/m3;
    % 物体2接触弹簧，物体1自由落体
    elseif y2((i/2)*2+2-i) >= y1((i/2)*2+2-i)&&y3((i/2)*2+2-i) >= y1((i/2)*2+2-i)&&y1((i/2)*2+2-i) <= 0
        Ft = -N*k*(sqrt(R*R+y1((i/2)*2+2-i)*y1((i/2)*2+2-i))-R)*y1((i/2)*2+2-i)/sqrt(R*R+y1((i/2)*2+2-i)*y1((i/2)*2+2-i));     % 弹簧力
        Fa = Pi*Ca*R*R*R*v1((i/2)*2+2-i)*v1((i/2)*2+2-i)*sign(v1((i/2)*2+2-i))/(sqrt(R*R+y1((i/2)*2+2-i)*y1((i/2)*2+2-i))*6);
        Fd = -Cd*v1((i/2)*2+2-i)*sign(v1((i/2)*2+2-i));
        Fc = 2.5*sign(v1((i/2)*2+2-i));
        Fm2 = - Ca*Sh*(v2((i/2)*2+2-i)*v2((i/2)*2+2-i))*sign(v2((i/2)*2+2-i));
        Fm3 = - Ca*Sh*(v3((i/2)*2+2-i)*v3((i/2)*2+2-i))*sign(v3((i/2)*2+2-i));
        a1 = (Ft-Fa-Fd-Fc - m1 * g) / m1;       % 物体2的加速度
        a3 = -g+ Fm3/m3;
        a2 = -g+ Fm2/m2;
    elseif y2((i/2)*2+2-i) >= y3((i/2)*2+2-i)&&y1((i/2)*2+2-i) >= y3((i/2)*2+2-i)&&y3((i/2)*2+2-i) <= 0
        Ft = -N*k*(sqrt(R*R+y3((i/2)*2+2-i)*y3((i/2)*2+2-i))-R)*y3((i/2)*2+2-i)/sqrt(R*R+y3((i/2)*2+2-i)*y3((i/2)*2+2-i));     % 弹簧力
        Fa = Pi*Ca*R*R*R*v3((i/2)*2+2-i)*v3((i/2)*2+2-i)*sign(v3((i/2)*2+2-i))/(sqrt(R*R+y3((i/2)*2+2-i)*y3((i/2)*2+2-i))*6);
        Fd = -Cd*v3(i)*sign(v3((i/2)*2+2-i));
        Fc = 2.5*sign(v3((i/2)*2+2-i));
        Fm2 = - Ca*Sh*(v2((i/2)*2+2-i)*v2((i/2)*2+2-i))*sign(v2((i/2)*2+2-i));
        Fm1 = - Ca*Sh*(v1((i/2)*2+2-i)*v1((i/2)*2+2-i))*sign(v1((i/2)*2+2-i));
        a2 = -g;                      % 物体1的加速度
        a1 = -g;
        a3 = (Ft-Fa-Fd-Fc - m3 * g) / m3;       % 物体2的加速度
    else
        a1=-g;
        a2=-g;
        a3=-g;
    end
    v1((i+1/2)*2+1-i) = v1((i/2)*2+2-i) + a1 * dt; 
    if v1((i/2)*2+2-i)<=0&&v1((i+1/2)*2+1-i)>=0&&y2((i/2)*2+2-i) >= y1((i/2)*2+2-i)&&y3((i/2)*2+2-i) >= y1((i/2)*2+2-i)
    y1((i+1/2)*2+1-i) = y1((i/2)*2+2-i) + (v1((i/2)*2+2-i)+v1((i+1/2)*2+1-i))/2 * dt-y1((i/2)*2+2-i)-((E1+28800*y1((i/2)*2+2-i)^4)^0.25)/(2*sqrt(2*sqrt(2))*sqrt(15)); % 更新物体1的位置
    else
    y1((i+1/2)*2+1-i) = y1((i/2)*2+2-i) + (v1((i/2)*2+2-i)+v1((i+1/2)*2+1-i))/2 * dt; % 更新物体1的位置
    end
    v2((i+1/2)*2+1-i) = v2((i/2)*2+2-i) + a2 * dt;       % 更新物体2的速度
    if v2((i/2)*2+2-i)<=0&&v2((i+1/2)*2+1-i)>=0&&y1((i/2)*2+2-i) >= y2((i/2)*2+2-i)&&y3((i/2)*2+2-i) >= y2((i/2)*2+2-i)
    y2((i+1/2)*2+1-i) = y2((i/2)*2+2-i) + (v2((i/2)*2+2-i)+v2((i+1/2)*2+1-i))/2 * dt-y2((i/2)*2+2-i)-((E1+28800*y2((i/2)*2+2-i)^4)^0.25)/(2*sqrt(2*sqrt(2))*sqrt(15)); % 更新物体1的位置
    else
    y2((i+1/2)*2+1-i) = y2((i/2)*2+2-i) + (v2((i/2)*2+2-i)+v2((i+1/2)*2+1-i))/2 * dt; % 更新物体1的位置
    end
    v3((i+1/2)*2+1-i) = v3((i/2)*2+2-i) + a3 * dt;       % 更新物体2的速度
    if v2((i/2)*2+2-i)<=0&&v2((i+1/2)*2+1-i)>=0&&y1((i/2)*2+2-i) >= y2((i/2)*2+2-i)&&y3((i/2)*2+2-i) >= y2((i/2)*2+2-i)
    y3((i+1/2)*2+1-i) = y3((i/2)*2+2-i) + (v3((i/2)*2+2-i)+v3((i+1/2)*2+1-i))/2 * dt-y3((i/2)*2+2-i)-((E1+28800*y3((i/2)*2+2-i)^4)^0.25)/(2*sqrt(2*sqrt(2))*sqrt(15)); % 更新物体1的位置
    else
    y3((i+1/2)*2+1-i) = y3((i/2)*2+2-i) + (v3((i/2)*2+2-i)+v3((i+1/2)*2+1-i))/2 * dt; % 更新物体1的位置
    end
    if y1(1)>y11max
        y11max = y1(1);
    end
    if y1(2)>y12max
        y12max = y1(2);
    end
    if y2(1)>y21max
        y21max = y2(1);
    end
    if y2(2)>y22max
        y22max = y2(2);
    end
end

disp(y11max);
disp(y12max);
disp(y21max);
disp(y22max);